# Ultralytics YOLO 🚀, AGPL-3.0 license

# Parameters
nc: 80 # number of classes

backbone:
  # [from, number, module, args]
  - [-1, 1, TorchVision, [2048, "resnet50", "DEFAULT", True, 2, True]]  # - 0
  - [0, 1, Index, [64, 3]]   # selects 3rd output (1, 64, 320, 320) - 1
  - [0, 1, Index, [256, 5]]   # selects 5th output (1, 256, 160, 160) - 2
  - [0, 1, Index, [512, 6]]   # selects 6th output (1, 512, 80, 80) - 3
  - [0, 1, Index, [1024, 7]]  # selects 7th output (1, 1024, 40, 40) - 4
  - [0, 1, Index, [2048, 8]]  # selects 8th output (1, 2048, 20, 20) - 5
  - [-1, 1, SPPF, [1024, 5]] # SPFF - 6

head:
  - [-1, 1, Conv, [768, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P5
  - [-1, 3, C3, [768, False]] # 10

  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C3, [512, False]] # 14

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C3, [256, False]] # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 20], 1, Concat, [1]] # cat head P4
  - [-1, 3, C3, [512, False]] # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P5
  - [-1, 3, C3, [768, False]] # 24 (P5/32-large)

  - [-1, 1, Conv, [768, 3, 2]]
  - [[-1, 7], 1, Concat, [1]] # cat head P6
  - [-1, 3, C3, [1024, False]] # 27 (P6/64-xlarge)

  - [[18, 21, 24, 27], 1, Detect, [nc]] # Detect(P3, P4, P5, P6)
